//Input
int number = int.Parse(Console.ReadLine());

//Calculations


//Output
if (number < 100 && number != 0 || number > 200)
{
  Console.WriteLine("invalid");
}




/*Невалидно число
Дадено число е валидно, ако е в диапазона [100…200] или е 0. Да се напише програма, която чете цяло число, въведено 
от потребителя, и печата "invalid" ако въведеното число не е валидно. 
Примерен вход и изход
вход
изход
75
invalid
150
(няма изход)
220
invalid
199
(няма изход)

изход
-1
invalid
100
(няма изход)
200
(няма изход)
0
(няма изход)

*/